terraform plan:
```
aws_vpc.dev_vpc: Refreshing state... [id=vpc-028035cce68e72eb9]
data.aws_ami.debian: Reading...
data.aws_ami.debian: Read complete after 1s [id=ami-0be49b0e69a32b6bb]
aws_internet_gateway.gw: Refreshing state... [id=igw-0362ca89270a7064d]
aws_subnet.dev_us_east_1a: Refreshing state... [id=subnet-0fe3927742492e5e2]
aws_security_group.all_access: Refreshing state... [id=sg-07b4d95979807d13c]
aws_default_route_table.default_route: Refreshing state... [id=rtb-00178679c1be22762]
aws_spot_instance_request.dev[0]: Refreshing state... [id=sir-9fvpe66j]
cloudflare_record.dev[0]: Refreshing state... [id=76acdec97e55d0990558f7e6524528f6]
aws_ec2_tag.dev_root_tags[0]: Refreshing state... [id=vol-08fff8e3574196187,Name]
aws_ec2_tag.dev_tags[0]: Refreshing state... [id=i-0766b2a9dc1e560fb,Name]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_spot_instance_request.dev[0] has been deleted
  - resource "aws_spot_instance_request" "dev" {
      - ami                             = "ami-0498587f552d38597" -> null
      - associate_public_ip_address     = true -> null
      - block_duration_minutes          = 0 -> null
      - get_password_data               = false -> null
      - id                              = "sir-9fvpe66j" -> null
      - instance_interruption_behavior  = "terminate" -> null
      - instance_interruption_behaviour = "terminate" -> null
      - instance_type                   = "t3.micro" -> null
      - ipv6_address_count              = 0 -> null
      - ipv6_addresses                  = [] -> null
      - key_name                        = "dev" -> null
      - primary_network_interface_id    = "eni-0c4d28d7a639b0598" -> null
      - private_dns                     = "ip-172-16-10-225.ec2.internal" -> null
      - private_ip                      = "172.16.10.225" -> null
      - public_dns                      = "ec2-3-86-100-25.compute-1.amazonaws.com" -> null
      - public_ip                       = "3.86.100.25" -> null
      - secondary_private_ips           = [] -> null
      - security_groups                 = [] -> null
      - source_dest_check               = true -> null
      - spot_bid_status                 = "fulfilled" -> null
      - spot_instance_id                = "i-0766b2a9dc1e560fb" -> null
      - spot_price                      = "0.010400" -> null
      - spot_request_state              = "active" -> null
      - spot_type                       = "one-time" -> null
      - subnet_id                       = "subnet-0fe3927742492e5e2" -> null
      - tags_all                        = {
          - "env" = "dev"
        } -> null
      - user_data                       = "31ec1668fbffe1e595b001ebea29965de15e4782" -> null
      - valid_from                      = "0001-01-01T00:00:00Z" -> null
      - valid_until                     = "2022-05-11T10:27:57Z" -> null
      - vpc_security_group_ids          = [
          - "sg-07b4d95979807d13c",
        ] -> null
      - wait_for_fulfillment            = true -> null

      - ephemeral_block_device {
          - device_name  = "xvdb" -> null
          - no_device    = false -> null
          - virtual_name = "ephemeral0" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-08fff8e3574196187" -> null
          - volume_size           = 20 -> null
          - volume_type           = "gp2" -> null
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_ec2_tag.dev_root_tags[0] will be created
  + resource "aws_ec2_tag" "dev_root_tags" {
      + id          = (known after apply)
      + key         = "Name"
      + resource_id = (known after apply)
      + value       = "dev0"
    }

  # aws_ec2_tag.dev_tags[0] will be created
  + resource "aws_ec2_tag" "dev_tags" {
      + id          = (known after apply)
      + key         = "Name"
      + resource_id = (known after apply)
      + value       = "dev0"
    }

  # aws_spot_instance_request.dev[0] will be created
  + resource "aws_spot_instance_request" "dev" {
      + ami                                  = "ami-0be49b0e69a32b6bb"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_interruption_behavior       = "terminate"
      + instance_interruption_behaviour      = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "dev"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_bid_status                      = (known after apply)
      + spot_instance_id                     = (known after apply)
      + spot_price                           = (known after apply)
      + spot_request_state                   = (known after apply)
      + spot_type                            = "persistent"
      + subnet_id                            = "subnet-0fe3927742492e5e2"
      + tags_all                             = {
          + "env" = "dev"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "204cb943d89f069a5a57c2d157f165ae28e7cea2"
      + user_data_base64                     = (known after apply)
      + valid_from                           = (known after apply)
      + valid_until                          = (known after apply)
      + vpc_security_group_ids               = [
          + "sg-07b4d95979807d13c",
        ]
      + wait_for_fulfillment                 = true

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = {
              + "Name" = "dev0"
            }
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 10
          + volume_type           = (known after apply)
        }
    }

  # cloudflare_record.dev[0] will be updated in-place
  ~ resource "cloudflare_record" "dev" {
        id              = "76acdec97e55d0990558f7e6524528f6"
        name            = "dev0"
      ~ value           = "3.86.100.25" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 3 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ dev_ip = [
      - "3.86.100.25",
      + (known after apply),
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```